#include <stdio.h>

int main(){
	
	unsigned int c,e,i,p,k;
	unsigned int s = 512;

	printf("Введите маски каналов 0-3 (0..15) ");
	scanf("%d", &c);
	printf("Введите маску внешнего прерывания (0/1) ");
	scanf("%d", &e);
	printf("Введите маску внутреннего прерывания (0/1) ");
	scanf("%d", &i);
	printf("Введите маску программного прерывания (0/1) ");
	scanf("%d", &p);
	printf("Введите ключ защиты памяти (0..7) ");
	scanf("%d", &k);
	
	s = (c&0xF) << 12;
	s += (e&0x1) << 11;
	s += (i&0x1) << 10;
	s += (p&0x1) << 9;
	s += (k&0x7) << 3;

	printf("Слово состояния устройства = %04X\n", s);


}
