#include <stdio.h>

int main(){
	
	unsigned int c,e,i,p,k,s;
	printf("Введите слово состояния программы (16-ричное число от 0 до 0xFFFF): ");
	scanf("%x",&s);

	c = (s >> 12) & 0xF;
	e = (s >> 11) & 0x1;
	i = (s >> 10) & 0x1;
	p = (s >> 9) & 0x1;
	k = (s >> 3) & 0x7;

	printf("Маски каналов 0-3: %d\n", c);
	printf("Маска внешнего прерывания: %d\n", e);
	printf("Маска внутреннего прерывания: %d\n", i);
	printf("Маска программного прерывания: %d\n", p);
	printf("Ключ защиты памяти: %d\n", k);
	
	return 0;
}
